_posts/2014-10-10-Android-Tips.html
---
excerpt: some interesting tips for android (keep updating)
layout: post
category : android
tags : [android, tips, screenrecord]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Screen Record</h2>
<div class="outline-text-2" id="text-1">
<p>
As a big fan of clash of clans, I want to share some videos of clan battle. When finding the solution under both ios and android. It appears that android has a much easier way with just one command in adb shell.
</p>
<div class="org-src-container">

<pre class="src src-bash">adb shell screenrecord /sdcard/filename.mp4
</pre>
</div>
<p>
When you're done, hit CTRL-C to stop recording. The video will be right there.
</p>
</div>
</div>
